Hi @madhu2852,
which provider did you use?

I still see an error with 3.49 but success with 3.48, so I though it doesn't depend on AWS API but terraform provider version.

```
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v3.49.0...
- Installed hashicorp/aws v3.49.0 (signed by HashiCorp)


$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb_target_group.gwlb will be created
  + resource "aws_lb_target_group" "gwlb" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 20
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "gwlb"
      + port                               = 6081
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "GENEVE"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "aws_lb_target_group_test_case"
        }
      + tags_all                           = {
          + "Name" = "aws_lb_target_group_test_case"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "80"
          + protocol            = "TCP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_vpc.security will be created
  + resource "aws_vpc" "security" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.1.0/24"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "aws_lb_target_group_test_case"
        }
      + tags_all                         = {
          + "Name" = "aws_lb_target_group_test_case"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_vpc.security: Creating...
aws_vpc.security: Still creating... [10s elapsed]
aws_vpc.security: Creation complete after 15s [id=vpc-1111111111192]
aws_lb_target_group.gwlb: Creating...
╷
│ Error: error creating LB Target Group: ValidationError: You cannot specify tags on creation of a GENEVE target group
│ 	status code: 400, request id: xxxxxxxx-xxxx-xxxx-a4b9-66939cac4bf4
│ 
│   with aws_lb_target_group.gwlb,
│   on main.tf line 11, in resource "aws_lb_target_group" "gwlb":
│   11: resource "aws_lb_target_group" "gwlb" {
│ 
╵


```

===>> Error


version 3.48:
```
$ terraform providers

Providers required by configuration:
.
└── provider[registry.terraform.io/hashicorp/aws] 3.48.0

╷



$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb_target_group.gwlb will be created
  + resource "aws_lb_target_group" "gwlb" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 20
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "gwlb"
      + port                               = 6081
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "GENEVE"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "aws_lb_target_group_test_case"
        }
      + tags_all                           = {
          + "Name" = "aws_lb_target_group_test_case"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "80"
          + protocol            = "TCP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_vpc.security will be created
  + resource "aws_vpc" "security" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.1.0/24"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "aws_lb_target_group_test_case"
        }
      + tags_all                         = {
          + "Name" = "aws_lb_target_group_test_case"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Version constraints inside provider configuration blocks are deprecated
│ 
│   on version.tf line 2, in provider "aws":
│    2:   version = "3.48"
│ 
│ Terraform 0.13 and earlier allowed provider version constraints inside the provider configuration block, but that is now deprecated and will be removed in a
│ future version of Terraform. To silence this warning, move the provider version constraint into the required_providers block.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_vpc.security: Creating...
aws_vpc.security: Still creating... [10s elapsed]
aws_vpc.security: Creation complete after 14s [id=vpc-11111111111b]
aws_lb_target_group.gwlb: Creating...
aws_lb_target_group.gwlb: Creation complete after 2s [id=arn:aws:elasticloadbalancing:eu-west-1:xxxxxxxxxxx:targetgroup/gwlb/006deb32401adc7501]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.



```